Revit 2027 API
Camera.EyePosition Property
 Camera's position in the world
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ EyePosition { get; set; }
Public Property EyePosition As XYZ
	Get
	Set
public:
property XYZ^ EyePosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
member EyePosition : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace